{
  "ticker": "JNJ",
  "year": 2025,
  "quarter": 2,
  "title": "JNJ Q2 2025 Earnings Call",
  "call_date": "",
  "text": "Joaquin Duato, our chairman and CEO, will discuss our business performance and key catalysts. I will then review the second quarter's sales and P&L results. Joe Wolk, our CFO, will then close by sharing an overview of our cash position and guidance update for 2025. Jennifer Taubert, Executive Vice President Worldwide Chairman, Innovative Medicine.\n\nJohn Reed, Executive Vice President, Innovative Medicine, Research and Development, and Tim Schmid, Executive Vice President, Worldwide Chairman, MedTech, will be joining us for Q&A. To ensure we provide enough time to address your questions, we anticipate the webcast will last approximately sixty minutes. With that, I will now turn the call over to Joaquin.\n\nJoaquin Duato: Thank you, Darren. And hello, everyone. I'm excited to talk about our very strong second quarter. Today's results showcase the strength of our uniquely diversified business as the only major healthcare company operating in both the MedTech and innovative medicine sectors. In the second quarter, we delivered operational sales growth of 4.6% across our business. In innovative medicine, we reported 3.8% operational sales growth, delivering more than $15 billion in quarterly sales for the first time. No other healthcare company has grown through the loss of exclusivity of a multibillion-dollar product in the first year. In our case, STELARRA, and yet, that is exactly what we are doing and for the second quarter in a row.\n\nOur performance was driven by double-digit growth across thirteen brands, including DARZALEX, CARVICTI, TECVAYLI, TALVEY, as well as RYBREVANT and PLUVITTO, and SPRAVATO. Delivering 6.1% operational sales growth, with particularly strong momentum in cardiovascular, surgery, and vision. Based on our strong performance in the quarter, we are pleased to raise our full-year sales guidance by $2 billion and EPS guidance by $0.25 from $10.60 to $10.85. Results like these are a direct result of our deep and resilient portfolio. It's what makes Johnson & Johnson unique. Today, we will focus on the remarkable ways we are driving innovation and creating value for patients and shareholders.\n\nWe'll highlight the depth of our portfolio and pipeline, focusing on six areas of unmet need and where we are delivering significant growth: oncology, immunology, neuroscience, cardiovascular, surgery, and vision. These are spaces where we are moving the conversation from treatment to cure and where we are extending and improving lives in meaningful ways. Let's start with innovative medicine and oncology to illuminate where we have a bold vision for cancer. Our leading products for the treatment of blood cancers and solid tumors are built on cutting-edge scientific platforms that are transforming outcomes for patients.\n\nWith more than ten products in the market, across twenty-six approved indications, and over twenty-five treatments in late-stage development, we expect to become the number one oncology company by 2030 with sales of more than $50 billion. And when you look at our quarterly results in oncology, with operational sales growth of 22.3%, you can see that we are well on our way to achieving that. I'll draw your attention to three key areas of Q2 progress. First is multiple myeloma, where we have treatments in every line of therapy. Approximately 80% of myeloma patients today receive a Johnson & Johnson medicine at some point in their treatment journey. And in Q2, we presented several important sets of data.\n\nThey include new five-year data showing a single treatment of our CAR T therapy CARVICTI has the potential to deliver long-term remission. We also presented the first data from our investigational trispecific antibody, which showed an unprecedented 100% overall response rate in heavily pretreated patients. With results like this, we are closer than ever to our ambition of curing multiple myeloma. Second is lung cancer, where our chemotherapy-free combination of RYBREVANT plus LUMAKRAS has a projected overall survival of at least a year over the current standard of care in frontline non-small cell lung cancer with EGFR gene mutations. Intent to prescribe continues to grow among healthcare professionals, which you can see in our strong quarterly sales.\n\nThis is a life-changing advancement for patients and one we are building on with a pipeline of novel therapies. And third is bladder cancer, where we are excited to share that we have received FDA priority review for TAR-200, a first-of-its-kind drug-releasing system. We anticipate launching TAR-200 for high-risk, non-muscle invasive bladder cancer later this year with a transformational product that harnesses our unique expertise in both innovative medicine and MedTech. We expect TAR-200 to generate at least $5 billion in annual peak year sales. In immunology, we have a 25-year legacy of redefining the standard of care, and we are just getting started.\n\nWith six products in the market across fourteen approved indications and many treatments in late-stage development, we are expanding treatment options for patients and restoring health for millions of people around the world. From REMICADE and SIMPONI to STELARRA and TREMFYA, we are now exploring targeted oral peptides and future combinations. The growth potential of our immunology portfolio and pipeline continues to be significant. In immunology, I will draw your attention to two key areas of Q2 progress. First, TREMFYA, which has recently expanded into inflammatory bowel disease. TREMFYA grew 30% in the quarter. With strong uptake in Crohn's disease and ulcerative colitis, we expect TREMFYA to generate at least $10 billion annually in peak year sales.\n\nWe also made important progress in our pipeline in Q2 and expect to file ICHTHYOKINRA with the FDA in the third quarter as the first targeted oral peptide to selectively block the IL-23 receptor with similar efficacy to a biologic. As a once-a-day pill, this molecule has the potential to set a new standard in the treatment of plaque psoriasis, and we look forward to sharing more in the coming months. In neuroscience, we are building on a 70-year legacy and expect to be the number one company by the end of the decade. We are pushing boundaries in diseases like schizophrenia, depression, and Alzheimer's, which together affect one in eight people worldwide.\n\nIn Q2, SPRAVATO grew 53%, delivering sustained double-digit growth and demonstrating the power of this medicine for patients living with difficult-to-treat depression. We also completed the acquisition of Intracellular Therapies this quarter. Intracellular's CAPLYTA is approved to treat adults with schizophrenia and bipolar depression, and we are excited about the anticipated major depressive disorder approval later this year. With the addition of CAPLYTA, we now have five neuroscience products in the market across six approved indications and eight treatments in late-stage development. CAPLYTA adds to Johnson & Johnson's robust lineup of therapies with $5 billion-plus potential in peak year sales and further solidifies sales growth above analyst expectations through the rest of the decade.\n\nTurning to MedTech and in cardiovascular specifically, we are leaders in heart recovery, circulatory restoration, and electrophysiology. Cardiovascular has some of the largest unmet needs in healthcare and is one of the fastest-growing spaces in MedTech. In Q2, we delivered over 22% operational sales growth over the quarter, driven by new product performance in Abiomed, Shockwave, and strength in mapping in electrophysiology. Today, we are a leader in four of the largest and highest-growth MedTech segments within cardiovascular intervention, impacting more than one million patients each year. Now let me highlight three areas of important progress from Q2.\n\nFirst is electrophysiology, which delivered close to 10% operational sales growth over the quarter, driven by new product performance and strength in mapping. We have now completed more than 10,000 VARIPULSE cases globally, with a reported neurovascular event rate of less than 0.5%, consistent with published rates across other PFA platforms. Second, we continue to advance a suite of cardiovascular solutions to expand our market leadership, including our dual-energy ThermoCool SmartTouch SF catheter, where we performed our first cases in Europe this quarter. It also includes Omnipulse, where we presented strong early data that will expand our portfolio of tools for safe and streamlined ablation procedures.\n\nThird is Shockwave's unique intravascular lithotripsy technology, or IVL, which has transformed the treatment of atherosclerotic cardiovascular disease and is driving significant growth. Shockwave is expected to be our $13 billion MedTech platform by the end of the year, a position that is further strengthened by a compelling body of evidence on the benefits of this technology. This includes data showing an IVL-first approach can achieve excellent outcomes in female patients with complex calcified coronary artery disease. In surgery, we have spent 140 years advancing the standard of care, and today, our surgical technologies are used in most operating rooms around the world.\n\nQ2 highlights include the introduction of the Ethicon 4000 surgical stapler, the newest advancement in our surgical portfolio. Featuring advanced stapling technology and reloads, the Ethicon 4000 minimizes surgical leaks and bleeding, which are common and costly surgical complications for patients and hospitals. This advanced stapling technology will be harnessed for future use exclusively on the Ottava robotic surgery system. And as mentioned on our earnings call in April, Ottava completed its first clinical cases with gastric bypass surgeries performed in Houston.\n\nIn our conversations with surgeons who have spent time on Ottava, they tell us that they are eager for the system's sophisticated architecture, design features like Twinmotion, the surgeon, and trusted Ethicon advanced instrumentation only available in Ottava and the future connection to our open digital ecosystem Polyphonic. We plan to submit for an FDA de novo approval next year. And finally, Vision, where we have a deep legacy in developing transformational innovation. With quarterly growth of 4.6% across the business and 8.9% in Surgical Vision, the portfolio has a robust growth trajectory driven by our Acuvue OASYS MAX 1-Day family of contact lenses and our TECNIS Eyhance and TECNIS Synergy intraocular lenses.\n\nAnd with the Q2 release of the first disposable multifocal lenses for people with astigmatism, we have high expectations. You know, few other healthcare companies can talk about their impact across many high-growth areas as Johnson & Johnson. And none spanning both innovative medicine and MedTech. These six examples are only a cross-section of our cutting-edge portfolio. The depth and breadth is who we are at Johnson & Johnson. It's how we grow through a major loss of exclusivity, how we have reinvented ourselves time and time again, and how we will deliver strong financial performance through the end of the decade and beyond. The bottom line is this: Johnson & Johnson's relentless focus on innovation yields results.\n\nQuarter after quarter, year after year. I will now turn the call back over to Darren.\n\nDarren Snellgrove: Thank you, Joaquin. Moving to our financial results. Unless otherwise stated, the percentages quoted represent operational results and therefore exclude the impact of currency translation. Starting with Q2 2025 sales results. Worldwide sales were $23.7 billion for the quarter. Sales increased 4.6% despite an approximate 710 basis point headwind from STELARRA. Growth in the US was 7.8% and 0.6% outside of the US. Worldwide growth was positively impacted by 160 basis points primarily due to the Intracellular and Shockwave acquisitions. Turning now to earnings. For the quarter, net earnings were $5.5 billion with diluted earnings per share of $2.29 versus diluted earnings per share of $1.93 a year ago.\n\nAdjusted net earnings for the quarter were $6.7 billion with adjusted diluted earnings per share of $2.77, representing a decrease of 2.1% and 1.8% respectively, compared to the second quarter of 2024. The decrease is driven by interest associated with incremental debt from the Intracellular acquisition and GP erosion from STELARRA. I will now comment on business sales performance in the quarter, with a focus on the six areas Joaquin discussed that will drive significant growth for the enterprise. Beginning with innovative medicine, where our results demonstrate the depth of our expertise in oncology, immunology, and neuroscience.\n\nWorldwide sales of $15.2 billion increased 3.8% despite an approximate 1170 basis point headwind from STELARRA, demonstrating the strength of our key brands and new launches. Growth in the US was 7.6% and minus 1.6% outside the US. Growth outside of the US was negatively impacted by STELARRA biosimilars and the COVID-19 vaccine. Acquisitions and divestitures had a net positive impact of 140 basis points on worldwide growth due to the Intracellular acquisition. In oncology, starting with myeloma, DARZALEX growth was 21.5%, primarily driven by continued strong share gains of approximately 4.1 points across all lines of therapy, with close to 8 points in the frontline setting as well as market growth.\n\nCARVICTI achieved sales of $439 million with growth of over 100%, driven by share gains and capacity expansion. This reflects continued strong sequential growth of 17.9% as we expand outside of the US. TECVAYLI and TALVEY growth was 22.4% and 54.3%, respectively, bolstered by continued expansion into the community setting. Patient demand remains strong despite continued adoption of longer dosing intervals. In prostate cancer, ERLEADA delivered strong growth of 21%, with continued share gains and market growth. In lung cancer, RYBREVANT plus LUMAKRAS delivered sales of $179 million and growth over 100%, with sequential growth of 26.5% driven by continued strong launch uptake. We continue to see share gains in both first and second lines of therapy.\n\nWithin immunology, TREMFYA delivered growth of 30.1%, primarily driven by share gains with continued strong uptake across recently launched IBD indications and overall market growth. STELARRA declined by 43.2%, driven by the impact of biosimilar competition and Part D redesign, which is in line with our expectations. In neuroscience, SPRAVATO growth of 53% was driven by continued strong demand from physicians and patients. Long-acting injectables declined by 6.3% due to the impact of Part D redesign and unfavorable patient mix. I'll now turn your attention to MedTech. Worldwide sales of $8.5 billion increased 6.1%, with growth of 8% in the US and 4.1% outside the US, driven by strong performance in three focus areas: cardiovascular, surgery, and vision.\n\nAcquisitions and divestitures had a net positive impact primarily due to Shockwave. In cardiovascular, electrophysiology delivered growth of 9.8% versus prior year, driven by strength in competitive mapping, new product performance, and procedure growth. Abiomed delivered growth of 16.9% with continued strong adoption of Impella technology, and Shockwave delivered strong double-digit growth with the recent introduction of the Javelin and E8 catheters. As a reminder, the acquisition benefit of Shockwave was lapped at the end of May. Surgery grew 1.8% despite divestitures negatively impacting results by approximately 60 basis points. Performance was primarily driven by technology penetration and wound closure, the strength of the portfolio, and biosurgery.\n\nGrowth was partially offset by competitive pressures in energy and the negative impact of China VBP across the portfolio. In vision, contact lenses and other ocular products grew 2.9%, driven by strategic price actions and strong performance in the Acuvue OASYS 1-Day family of contact lenses, including the recent launch of OASYS MAX 1-Day multifocal for astigmatism. Surgical vision growth of 8.9% continues to be driven by strong performance in TECNIS Eyhance, TECNIS Synergy, and iHANCE. The orthopedics business declined by 1.6%, driven by competitive pressures, the transformation program, and China VBP. Now turning to our consolidated statement of earnings for the second quarter of 2025.\n\nI'd like to highlight a few noteworthy items that have changed compared to the same quarter a year ago. Cost of products sold deleveraged by 150 basis points, driven by product mix and amortization related to the Intracellular, as well as MedTech macroeconomic factors and VBP in China. Selling, marketing, and administrative expenses improved 50 basis points, driven by corporate expense rationalization, partially offset by increased investment in recent acquisitions. In research and development expenses leveraged by 50 basis points, primarily driven by portfolio rationalization and expense phasing in MedTech. We continued our strong investment in research and development, with $3.5 billion or approximately 15% of sales in Q2.\n\nInterest income and expense was a net expense of $48 million as compared to $125 million of income in the second quarter of 2024, primarily driven by lower rates of interest earned on cash balances and a higher average debt balance associated with the Intracellular acquisition. Other income and expense was a net expense of $0.1 billion compared to an expense of $0.7 billion in the prior year, primarily driven by lower talc litigation expense in 2025 and the $0.4 billion loss on the sale of the retained stake in Cambrex as recorded in 2024. Regarding taxes in the quarter, our effective tax rate was 14.7% compared to 18.5% in the same period last year.\n\nI encourage you to review our upcoming 10-Q for details on changes in taxes. Lastly, I'll direct your attention to the box section of the slide, we have also provided the company's income before tax, net earnings, and earnings per share adjusted to exclude the impact of intangible amortization expense and special items. Now let's look at adjusted income before tax by segment for the quarter. In support of our efforts to increase financial transparency, you will again find GAAP to non-GAAP reconciliations by segment in the supplemental schedules of our press release. Innovative medicine margin declined from 44.6% to 42.7%, primarily driven by negative mix in cost of products sold related to STELARRA.\n\nMedTech margin declined from 25.7% to 22.2%, driven by macroeconomic factors in cost of products sold, as well as other income. This concludes the sales and earnings portion of the call. And I will now turn the call over to John.\n\nJohn Reed: Thank you, Darren, and glad to see your first earnings call is off to a good start. I look forward to you leveraging your recent experience leading the innovative medicine finance team to benefit Johnson & Johnson's investor relations function. Hello, everyone. Thank you for joining us today. As already highlighted, we delivered a very strong second quarter exceeding expectations on both the top and bottom line. While our currently marketed products and platforms drove this quarter's performance, the progress across our pipeline in the first half of the year heightens our conviction to achieve and I'd be willing to bet likely beat the upper end of the growth targets we conveyed at our 2023 enterprise business review.\n\nAs previously mentioned by Joaquin and Darren, the innovative medicine business continues to grow through STELARRA's loss of exclusivity driven by our end-market portfolio. We continue to advance our pipeline attaining significant clinical and regulatory milestones that will help drive sustained and accelerating growth through the back half of the decade. In MedTech, while we still have work to do, we saw improvement over first-quarter results. Driven by strong performance in the cardiovascular portfolio, surgical vision, and wound closure in surgery. We remain focused on higher-growth markets, enhancing competitiveness to gain market share, and executing against our transformation initiatives to improve margins. Let's get into some of the financial commentary starting with our cash position.\n\nFree cash flow through the first half of 2025 exceeded $6 billion, which accounts for elevated tax payments related to the final annual TCJA toll tax payment when compared to the first half of 2024. We ended the second quarter with $19 billion of cash and marketable securities and $51 billion of debt for a net debt position of $32 billion. These figures include the debt raised for the $14.5 billion Intracellular acquisition, which closed on April 2nd. Regarding talc litigation, we expect the Daubert hearing to commence this fall and look forward to the court reexamining the junk science the mass tort plaintiff's bar has funded to promote baseless talc claims against Johnson & Johnson.\n\nTurning to our full-year guidance for 2025. Driven by the strength of our first-half performance, we are increasing our operational sales guidance for the full year by approximately $900 million. We are now expecting operational sales growth for the full year to be in the range of 4.5% to 5%, with a midpoint of $92.9 billion or 4.8%, representing a full point better when compared to prior guidance. Excluding the impact from acquisitions and divestitures, our adjusted operational sales growth is now expected to be in the range of 3.2% to 3.7% compared to 2024. As you know, we don't speculate on future currency movements. Last quarter, we utilized the euro spot rate relative to the US dollar of 1.11.\n\nThe US dollar has weakened across all major currencies since April. Last week, the euro spot rate relative to the US dollar was 1.17. We estimate an incremental positive foreign currency impact of $1.1 billion versus previous guidance. As such, we now expect reported sales growth between 5.1% to 5.6% with a midpoint of $93.4 billion or 5.4%. Currently, our guidance does not include the impact of the most favored nation concepts. With respect to MFN, we share the administration's goal that American patients should pay less by addressing the real drivers of higher US costs, including middlemen driving up prices, and foreign markets not paying their fair share. Turning to other notable items on the P&L.\n\nAt the beginning of the year, we guided to an approximate 300 basis points improvement in operating margin. Despite what you may have calculated on a year-to-date basis, we remain confident and reiterate our operating margin guide for the full year. This is due to efficiency programs designed for margin improvement as well as nonrecurring one-time IPR&D charges that occurred in the second half of 2024. This expected improvement also takes into consideration the dilution from the Intracellular transaction as well as what we know today about the impact of tariffs on our business. During our first-quarter conference call, we anticipated an impact from tariffs in 2025 to be approximately $400 million.\n\nBased on the current tariff landscape, we now anticipate exclusively related to our MedTech business. We will look to reinvest the differential to continue to accelerate our pipeline and further power the launch of our new products. Those on the market with new indications and those with near-term anticipated approvals. We continue to monitor what the future year's impact could be from tariffs on our business. For net interest expense, we now project between $0 and $100 million, an improvement from the previous guidance, primarily driven by higher interest earned on cash balances.\n\nOur effective tax rate is now expected to be in the range of 17% to 17.5% for the full year, with the increase largely due to an adjustment to the company's global tax reserves. We are pleased that the One Big Beautiful Bill Act provides certainty for our previously announced $55 billion commitment to invest here in the United States. This includes provisions such as permanent expensing for domestic R&D spend, permanent bonus depreciation, and 100% expensing of qualified production property, including our newly planned facility in North Carolina. We also welcome the improvements that were made to the international tax system.\n\nFor your modeling, it is worth noting that the tax rate on foreign earnings known as GILTI is increasing by approximately 2% from a statutory rate of 10.5% to 12.6%. This will result in an approximate 1% increase to our global effective tax rate in 2026. Turning to earnings per share. We are pleased to increase our reported adjusted earnings per share estimate by $0.25 to $10.85 or 8.7% at the midpoint. For a range of $10.80 to $10.90, which is a combination of operational improvement and the favorable foreign currency dynamics I referenced earlier. Embedded in that is $0.08 of adjusted operational earnings per share, increasing our guidance to $10.68 or 7% at the midpoint.\n\nI'll now provide some qualitative considerations on phasing for your models. We continue to expect both innovative medicine and MedTech operational sales growth to be higher in the second half of the year versus the first half. Regarding innovative medicine, we maintain the assumption that STELARRA's biosimilar competition will accelerate throughout the year with erosion similar to HUMIRA's in year two. Turning to MedTech, we anticipate an acceleration in growth to be driven by the increased adoption of newly launched products in cardiovascular, surgery, and vision. We continue to expect normalized procedure volumes and typical seasonality patterns throughout the remainder of the year.\n\nBeyond our financial commitments and what Joaquin has already referenced, we are excited for the expected pipeline progress in the remainder of 2025. In innovative medicine, this includes expected approvals in TAR-200, in non-muscle invasive bladder cancer, subcutaneous RYBREVANT for non-small cell lung cancer in the US, TREMFYA subcutaneous induction for ulcerative colitis, and CAPLYTA for adjunctive major depressive disorder. Anticipated filings for approval include ICHTHYOKINRA in psoriasis and TREMFYA in psoriatic arthritis. As far as data readouts, we are planning for RYBREVANT, head and neck cancer, and ICHTHYOKINRA in ulcerative colitis as well as head-to-head data versus STELARA in psoriasis. In MedTech, we continue to make progress with our clinical trials for our Ottava robotic surgical system.\n\nIn our cardiovascular portfolio, we are planning regulatory submission for dual-energy ThermoCool SmartTouch SF catheter for cardiac arrhythmia in the US. An Impella ECP submission in heart recovery as well as Javelin and Shockwave E8 launches in circulatory restoration. In orthopedics, we will be launching a tune revision hinge, a new plating system called Volt in the US. We will also be launching the Ethicon 4000 stapler with 3D reloads in surgery and the Acuvue OASYS MAX in vision for astigmatism. In summary, I trust you agree the results delivered in the first half are evidence that our portfolio has the breadth and depth that enables us to attain growth.\n\nEven in the face of a major LOE, where very few, if any, other companies could. The clinical advancements provide a robust base for accelerated top-line growth, not just for the remainder of this year, but for the back half of the decade. We're confident that the strength of our business model enables Johnson & Johnson to navigate a dynamic external environment delivering on our financial commitments. This is directly attributable to the hard work and dedication of our 138,000 colleagues who focus daily on advancing our pipeline, increasing market share, and progressing breakthrough treatments to patients that create long-term value for our shareholders. Thank you. And with that, we are happy to take your questions.\n\nKevin, will you please provide instructions for those seeking to participate in the Q&A?\n\nOperator: Certainly. We'll obviously be conducting a question-and-answer session. If you'd like to ask a question, please press star one on your telephone keypad. Our first question is coming from Chris Schott from JPMorgan. Your line is now live.\n\nChris Schott: Great. Thanks so much for the question. Johnson & Johnson also reported a very strong top-line beat despite the STELARRA LOE. And I am just interested, Joe, in any color you might hire up in terms of the drivers of upside to the guidance for the year as we think about much of this is the innovative business versus MedTech. Any particular franchises in those businesses that's driving guidance raise? Thank you.\n\nJoe Wolk: Yeah. Good morning, Chris, and thank you very much for the question. I would say it's both are contributing in terms of the strong performance. And in fact, I would say this is a great opportunity for Jennifer and Tim to address some of the strength that we saw in our second-quarter results. As you saw, and credit to Jennifer and her team achieving the first $15 billion quarter, despite $1.2 billion of year-on-year erosion in the quarter from STELARRA. I don't think any other company can do that. And then, Tim, a notable improvement from what we reported in Q1.\n\nThat gives us a lot of enthusiasm for the balance of this year where we, as you heard in my earlier comments, we expect both businesses to actually continue that momentum and grow better in the second half than the first half. But when I turn it over to Jennifer and Tim, to give you some insights from their perspective?\n\nJennifer Taubert: Thank you so much, Joe, and good morning, everybody. And, Joe, you stole my thunder on the over $15 billion in our first $15 billion quarter. You know, importantly, if you take a look at the 90% of our business that is not STELARRA, we actually had extraordinarily robust growth of 15.5% growth really demonstrating the strength across our portfolio. We had thirteen brands that were growing double digits, and as we take a look at those, the vast majority of those are not only our growth drivers for today and tomorrow but are also key growth drivers out through the end of the decade. So a few of the notable drivers there.\n\nSo first in oncology, DARZALEX continues to perform very well. CARVICTI performed well. ERLEADA and we're really pleased with the launch uptakes thus far on RYBREVANT plus LUMAKRAS in non-small cell lung cancer. In immunology, TREMFYA is off to a great start in ulcerative colitis and also Crohn's disease. And across neuroscience, both SPRAVATO and CAPLYTA both had really, really strong performance for the quarter. So as I mentioned, brands with double-digit growth. I won't go into all of those, but really, really strong across the base of our business. And we're really excited throughout the rest of this year because we've got a number of additional catalysts that are coming through with additional approvals and such. Tim?\n\nTim Schmid: Thank you, Jennifer. And, Chris, to your question, I mean, for MedTech, we were happy with our Q2 operational growth of 6.1%. This is a 4.4% sequential improvement over the first quarter. I think you know the primary contributor is certainly cardiovascular, and we are by far and away now one of the largest and certainly the fastest-growing MedTech company in cardiovascular, not only...Tim Schmid: ...in terms of the size of the business but also in terms of the growth rate. We are seeing significant traction with our new product launches, and the integration of Shockwave and Abiomed is progressing well, contributing to our strong performance.\n\nAdditionally, our surgical and vision businesses are also showing robust growth, driven by the adoption of our innovative technologies and strategic pricing actions. We are confident that the momentum we have built in the first half of the year will continue into the second half, supported by our strong pipeline and ongoing investments in R&D. Overall, we are very pleased with the progress we are making across our MedTech portfolio and are excited about the opportunities ahead. Thank you for your question, Chris.\n\nOperator: Thank you. Our next question comes from Larry Biegelsen from Wells Fargo. Your line is open.\n\nLarry Biegelsen: Good morning. Thanks for taking the question. I wanted to ask about the competitive landscape in the immunology space, particularly with the biosimilar competition for STELARRA. How are you positioning your portfolio to address this challenge, and what are your expectations for market share retention in the coming quarters?\n\nJennifer Taubert: Good morning, Larry, and thank you for the question. As you know, the immunology space is highly competitive, and we have been preparing for the biosimilar competition for STELARRA for some time. Our strategy has been to focus on our differentiated portfolio and pipeline, which includes TREMFYA, SIMPONI, and our upcoming launches. TREMFYA, in particular, has been performing exceptionally well, with strong uptake in new indications such as ulcerative colitis and Crohn's disease. We are also advancing our pipeline with promising candidates like ICHTHYOKINRA, which we believe will set a new standard in the treatment of plaque psoriasis.\n\nOur goal is to maintain our leadership position in immunology by continuing to deliver innovative solutions that meet the needs of patients and healthcare providers. We are confident in our ability to navigate the competitive landscape and drive growth in this important therapeutic area. Thank you for your question, Larry.\n\nOperator: Thank you. Our next question comes from Terence Flynn from Morgan Stanley. Your line is open.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability.",
  "speaker_sections": [
    {
      "name": "Joaquin Duato",
      "start_char": 713,
      "end_char": 11324,
      "text": "Joaquin Duato: Thank you, Darren. And hello, everyone. I'm excited to talk about our very strong second quarter. Today's results showcase the strength of our uniquely diversified business as the only major healthcare company operating in both the MedTech and innovative medicine sectors. In the second quarter, we delivered operational sales growth of 4.6% across our business. In innovative medicine, we reported 3.8% operational sales growth, delivering more than $15 billion in quarterly sales for the first time. No other healthcare company has grown through the loss of exclusivity of a multibillion-dollar product in the first year. In our case, STELARRA, and yet, that is exactly what we are doing and for the second quarter in a row.\n\nOur performance was driven by double-digit growth across thirteen brands, including DARZALEX, CARVICTI, TECVAYLI, TALVEY, as well as RYBREVANT and PLUVITTO, and SPRAVATO. Delivering 6.1% operational sales growth, with particularly strong momentum in cardiovascular, surgery, and vision. Based on our strong performance in the quarter, we are pleased to raise our full-year sales guidance by $2 billion and EPS guidance by $0.25 from $10.60 to $10.85. Results like these are a direct result of our deep and resilient portfolio. It's what makes Johnson & Johnson unique. Today, we will focus on the remarkable ways we are driving innovation and creating value for patients and shareholders.\n\nWe'll highlight the depth of our portfolio and pipeline, focusing on six areas of unmet need and where we are delivering significant growth: oncology, immunology, neuroscience, cardiovascular, surgery, and vision. These are spaces where we are moving the conversation from treatment to cure and where we are extending and improving lives in meaningful ways. Let's start with innovative medicine and oncology to illuminate where we have a bold vision for cancer. Our leading products for the treatment of blood cancers and solid tumors are built on cutting-edge scientific platforms that are transforming outcomes for patients.\n\nWith more than ten products in the market, across twenty-six approved indications, and over twenty-five treatments in late-stage development, we expect to become the number one oncology company by 2030 with sales of more than $50 billion. And when you look at our quarterly results in oncology, with operational sales growth of 22.3%, you can see that we are well on our way to achieving that. I'll draw your attention to three key areas of Q2 progress. First is multiple myeloma, where we have treatments in every line of therapy. Approximately 80% of myeloma patients today receive a Johnson & Johnson medicine at some point in their treatment journey. And in Q2, we presented several important sets of data.\n\nThey include new five-year data showing a single treatment of our CAR T therapy CARVICTI has the potential to deliver long-term remission. We also presented the first data from our investigational trispecific antibody, which showed an unprecedented 100% overall response rate in heavily pretreated patients. With results like this, we are closer than ever to our ambition of curing multiple myeloma. Second is lung cancer, where our chemotherapy-free combination of RYBREVANT plus LUMAKRAS has a projected overall survival of at least a year over the current standard of care in frontline non-small cell lung cancer with EGFR gene mutations. Intent to prescribe continues to grow among healthcare professionals, which you can see in our strong quarterly sales.\n\nThis is a life-changing advancement for patients and one we are building on with a pipeline of novel therapies. And third is bladder cancer, where we are excited to share that we have received FDA priority review for TAR-200, a first-of-its-kind drug-releasing system. We anticipate launching TAR-200 for high-risk, non-muscle invasive bladder cancer later this year with a transformational product that harnesses our unique expertise in both innovative medicine and MedTech. We expect TAR-200 to generate at least $5 billion in annual peak year sales. In immunology, we have a 25-year legacy of redefining the standard of care, and we are just getting started.\n\nWith six products in the market across fourteen approved indications and many treatments in late-stage development, we are expanding treatment options for patients and restoring health for millions of people around the world. From REMICADE and SIMPONI to STELARRA and TREMFYA, we are now exploring targeted oral peptides and future combinations. The growth potential of our immunology portfolio and pipeline continues to be significant. In immunology, I will draw your attention to two key areas of Q2 progress. First, TREMFYA, which has recently expanded into inflammatory bowel disease. TREMFYA grew 30% in the quarter. With strong uptake in Crohn's disease and ulcerative colitis, we expect TREMFYA to generate at least $10 billion annually in peak year sales.\n\nWe also made important progress in our pipeline in Q2 and expect to file ICHTHYOKINRA with the FDA in the third quarter as the first targeted oral peptide to selectively block the IL-23 receptor with similar efficacy to a biologic. As a once-a-day pill, this molecule has the potential to set a new standard in the treatment of plaque psoriasis, and we look forward to sharing more in the coming months. In neuroscience, we are building on a 70-year legacy and expect to be the number one company by the end of the decade. We are pushing boundaries in diseases like schizophrenia, depression, and Alzheimer's, which together affect one in eight people worldwide.\n\nIn Q2, SPRAVATO grew 53%, delivering sustained double-digit growth and demonstrating the power of this medicine for patients living with difficult-to-treat depression. We also completed the acquisition of Intracellular Therapies this quarter. Intracellular's CAPLYTA is approved to treat adults with schizophrenia and bipolar depression, and we are excited about the anticipated major depressive disorder approval later this year. With the addition of CAPLYTA, we now have five neuroscience products in the market across six approved indications and eight treatments in late-stage development. CAPLYTA adds to Johnson & Johnson's robust lineup of therapies with $5 billion-plus potential in peak year sales and further solidifies sales growth above analyst expectations through the rest of the decade.\n\nTurning to MedTech and in cardiovascular specifically, we are leaders in heart recovery, circulatory restoration, and electrophysiology. Cardiovascular has some of the largest unmet needs in healthcare and is one of the fastest-growing spaces in MedTech. In Q2, we delivered over 22% operational sales growth over the quarter, driven by new product performance in Abiomed, Shockwave, and strength in mapping in electrophysiology. Today, we are a leader in four of the largest and highest-growth MedTech segments within cardiovascular intervention, impacting more than one million patients each year. Now let me highlight three areas of important progress from Q2.\n\nFirst is electrophysiology, which delivered close to 10% operational sales growth over the quarter, driven by new product performance and strength in mapping. We have now completed more than 10,000 VARIPULSE cases globally, with a reported neurovascular event rate of less than 0.5%, consistent with published rates across other PFA platforms. Second, we continue to advance a suite of cardiovascular solutions to expand our market leadership, including our dual-energy ThermoCool SmartTouch SF catheter, where we performed our first cases in Europe this quarter. It also includes Omnipulse, where we presented strong early data that will expand our portfolio of tools for safe and streamlined ablation procedures.\n\nThird is Shockwave's unique intravascular lithotripsy technology, or IVL, which has transformed the treatment of atherosclerotic cardiovascular disease and is driving significant growth. Shockwave is expected to be our $13 billion MedTech platform by the end of the year, a position that is further strengthened by a compelling body of evidence on the benefits of this technology. This includes data showing an IVL-first approach can achieve excellent outcomes in female patients with complex calcified coronary artery disease. In surgery, we have spent 140 years advancing the standard of care, and today, our surgical technologies are used in most operating rooms around the world.\n\nQ2 highlights include the introduction of the Ethicon 4000 surgical stapler, the newest advancement in our surgical portfolio. Featuring advanced stapling technology and reloads, the Ethicon 4000 minimizes surgical leaks and bleeding, which are common and costly surgical complications for patients and hospitals. This advanced stapling technology will be harnessed for future use exclusively on the Ottava robotic surgery system. And as mentioned on our earnings call in April, Ottava completed its first clinical cases with gastric bypass surgeries performed in Houston.\n\nIn our conversations with surgeons who have spent time on Ottava, they tell us that they are eager for the system's sophisticated architecture, design features like Twinmotion, the surgeon, and trusted Ethicon advanced instrumentation only available in Ottava and the future connection to our open digital ecosystem Polyphonic. We plan to submit for an FDA de novo approval next year. And finally, Vision, where we have a deep legacy in developing transformational innovation. With quarterly growth of 4.6% across the business and 8.9% in Surgical Vision, the portfolio has a robust growth trajectory driven by our Acuvue OASYS MAX 1-Day family of contact lenses and our TECNIS Eyhance and TECNIS Synergy intraocular lenses.\n\nAnd with the Q2 release of the first disposable multifocal lenses for people with astigmatism, we have high expectations. You know, few other healthcare companies can talk about their impact across many high-growth areas as Johnson & Johnson. And none spanning both innovative medicine and MedTech. These six examples are only a cross-section of our cutting-edge portfolio. The depth and breadth is who we are at Johnson & Johnson. It's how we grow through a major loss of exclusivity, how we have reinvented ourselves time and time again, and how we will deliver strong financial performance through the end of the decade and beyond. The bottom line is this: Johnson & Johnson's relentless focus on innovation yields results.\n\nQuarter after quarter, year after year. I will now turn the call back over to Darren.\n\n"
    },
    {
      "name": "Darren Snellgrove",
      "start_char": 11324,
      "end_char": 18727,
      "text": "Darren Snellgrove: Thank you, Joaquin. Moving to our financial results. Unless otherwise stated, the percentages quoted represent operational results and therefore exclude the impact of currency translation. Starting with Q2 2025 sales results. Worldwide sales were $23.7 billion for the quarter. Sales increased 4.6% despite an approximate 710 basis point headwind from STELARRA. Growth in the US was 7.8% and 0.6% outside of the US. Worldwide growth was positively impacted by 160 basis points primarily due to the Intracellular and Shockwave acquisitions. Turning now to earnings. For the quarter, net earnings were $5.5 billion with diluted earnings per share of $2.29 versus diluted earnings per share of $1.93 a year ago.\n\nAdjusted net earnings for the quarter were $6.7 billion with adjusted diluted earnings per share of $2.77, representing a decrease of 2.1% and 1.8% respectively, compared to the second quarter of 2024. The decrease is driven by interest associated with incremental debt from the Intracellular acquisition and GP erosion from STELARRA. I will now comment on business sales performance in the quarter, with a focus on the six areas Joaquin discussed that will drive significant growth for the enterprise. Beginning with innovative medicine, where our results demonstrate the depth of our expertise in oncology, immunology, and neuroscience.\n\nWorldwide sales of $15.2 billion increased 3.8% despite an approximate 1170 basis point headwind from STELARRA, demonstrating the strength of our key brands and new launches. Growth in the US was 7.6% and minus 1.6% outside the US. Growth outside of the US was negatively impacted by STELARRA biosimilars and the COVID-19 vaccine. Acquisitions and divestitures had a net positive impact of 140 basis points on worldwide growth due to the Intracellular acquisition. In oncology, starting with myeloma, DARZALEX growth was 21.5%, primarily driven by continued strong share gains of approximately 4.1 points across all lines of therapy, with close to 8 points in the frontline setting as well as market growth.\n\nCARVICTI achieved sales of $439 million with growth of over 100%, driven by share gains and capacity expansion. This reflects continued strong sequential growth of 17.9% as we expand outside of the US. TECVAYLI and TALVEY growth was 22.4% and 54.3%, respectively, bolstered by continued expansion into the community setting. Patient demand remains strong despite continued adoption of longer dosing intervals. In prostate cancer, ERLEADA delivered strong growth of 21%, with continued share gains and market growth. In lung cancer, RYBREVANT plus LUMAKRAS delivered sales of $179 million and growth over 100%, with sequential growth of 26.5% driven by continued strong launch uptake. We continue to see share gains in both first and second lines of therapy.\n\nWithin immunology, TREMFYA delivered growth of 30.1%, primarily driven by share gains with continued strong uptake across recently launched IBD indications and overall market growth. STELARRA declined by 43.2%, driven by the impact of biosimilar competition and Part D redesign, which is in line with our expectations. In neuroscience, SPRAVATO growth of 53% was driven by continued strong demand from physicians and patients. Long-acting injectables declined by 6.3% due to the impact of Part D redesign and unfavorable patient mix. I'll now turn your attention to MedTech. Worldwide sales of $8.5 billion increased 6.1%, with growth of 8% in the US and 4.1% outside the US, driven by strong performance in three focus areas: cardiovascular, surgery, and vision.\n\nAcquisitions and divestitures had a net positive impact primarily due to Shockwave. In cardiovascular, electrophysiology delivered growth of 9.8% versus prior year, driven by strength in competitive mapping, new product performance, and procedure growth. Abiomed delivered growth of 16.9% with continued strong adoption of Impella technology, and Shockwave delivered strong double-digit growth with the recent introduction of the Javelin and E8 catheters. As a reminder, the acquisition benefit of Shockwave was lapped at the end of May. Surgery grew 1.8% despite divestitures negatively impacting results by approximately 60 basis points. Performance was primarily driven by technology penetration and wound closure, the strength of the portfolio, and biosurgery.\n\nGrowth was partially offset by competitive pressures in energy and the negative impact of China VBP across the portfolio. In vision, contact lenses and other ocular products grew 2.9%, driven by strategic price actions and strong performance in the Acuvue OASYS 1-Day family of contact lenses, including the recent launch of OASYS MAX 1-Day multifocal for astigmatism. Surgical vision growth of 8.9% continues to be driven by strong performance in TECNIS Eyhance, TECNIS Synergy, and iHANCE. The orthopedics business declined by 1.6%, driven by competitive pressures, the transformation program, and China VBP. Now turning to our consolidated statement of earnings for the second quarter of 2025.\n\nI'd like to highlight a few noteworthy items that have changed compared to the same quarter a year ago. Cost of products sold deleveraged by 150 basis points, driven by product mix and amortization related to the Intracellular, as well as MedTech macroeconomic factors and VBP in China. Selling, marketing, and administrative expenses improved 50 basis points, driven by corporate expense rationalization, partially offset by increased investment in recent acquisitions. In research and development expenses leveraged by 50 basis points, primarily driven by portfolio rationalization and expense phasing in MedTech. We continued our strong investment in research and development, with $3.5 billion or approximately 15% of sales in Q2.\n\nInterest income and expense was a net expense of $48 million as compared to $125 million of income in the second quarter of 2024, primarily driven by lower rates of interest earned on cash balances and a higher average debt balance associated with the Intracellular acquisition. Other income and expense was a net expense of $0.1 billion compared to an expense of $0.7 billion in the prior year, primarily driven by lower talc litigation expense in 2025 and the $0.4 billion loss on the sale of the retained stake in Cambrex as recorded in 2024. Regarding taxes in the quarter, our effective tax rate was 14.7% compared to 18.5% in the same period last year.\n\nI encourage you to review our upcoming 10-Q for details on changes in taxes. Lastly, I'll direct your attention to the box section of the slide, we have also provided the company's income before tax, net earnings, and earnings per share adjusted to exclude the impact of intangible amortization expense and special items. Now let's look at adjusted income before tax by segment for the quarter. In support of our efforts to increase financial transparency, you will again find GAAP to non-GAAP reconciliations by segment in the supplemental schedules of our press release. Innovative medicine margin declined from 44.6% to 42.7%, primarily driven by negative mix in cost of products sold related to STELARRA.\n\nMedTech margin declined from 25.7% to 22.2%, driven by macroeconomic factors in cost of products sold, as well as other income. This concludes the sales and earnings portion of the call. And I will now turn the call over to John.\n\n"
    },
    {
      "name": "John Reed",
      "start_char": 18727,
      "end_char": 28001,
      "text": "John Reed: Thank you, Darren, and glad to see your first earnings call is off to a good start. I look forward to you leveraging your recent experience leading the innovative medicine finance team to benefit Johnson & Johnson's investor relations function. Hello, everyone. Thank you for joining us today. As already highlighted, we delivered a very strong second quarter exceeding expectations on both the top and bottom line. While our currently marketed products and platforms drove this quarter's performance, the progress across our pipeline in the first half of the year heightens our conviction to achieve and I'd be willing to bet likely beat the upper end of the growth targets we conveyed at our 2023 enterprise business review.\n\nAs previously mentioned by Joaquin and Darren, the innovative medicine business continues to grow through STELARRA's loss of exclusivity driven by our end-market portfolio. We continue to advance our pipeline attaining significant clinical and regulatory milestones that will help drive sustained and accelerating growth through the back half of the decade. In MedTech, while we still have work to do, we saw improvement over first-quarter results. Driven by strong performance in the cardiovascular portfolio, surgical vision, and wound closure in surgery. We remain focused on higher-growth markets, enhancing competitiveness to gain market share, and executing against our transformation initiatives to improve margins. Let's get into some of the financial commentary starting with our cash position.\n\nFree cash flow through the first half of 2025 exceeded $6 billion, which accounts for elevated tax payments related to the final annual TCJA toll tax payment when compared to the first half of 2024. We ended the second quarter with $19 billion of cash and marketable securities and $51 billion of debt for a net debt position of $32 billion. These figures include the debt raised for the $14.5 billion Intracellular acquisition, which closed on April 2nd. Regarding talc litigation, we expect the Daubert hearing to commence this fall and look forward to the court reexamining the junk science the mass tort plaintiff's bar has funded to promote baseless talc claims against Johnson & Johnson.\n\nTurning to our full-year guidance for 2025. Driven by the strength of our first-half performance, we are increasing our operational sales guidance for the full year by approximately $900 million. We are now expecting operational sales growth for the full year to be in the range of 4.5% to 5%, with a midpoint of $92.9 billion or 4.8%, representing a full point better when compared to prior guidance. Excluding the impact from acquisitions and divestitures, our adjusted operational sales growth is now expected to be in the range of 3.2% to 3.7% compared to 2024. As you know, we don't speculate on future currency movements. Last quarter, we utilized the euro spot rate relative to the US dollar of 1.11.\n\nThe US dollar has weakened across all major currencies since April. Last week, the euro spot rate relative to the US dollar was 1.17. We estimate an incremental positive foreign currency impact of $1.1 billion versus previous guidance. As such, we now expect reported sales growth between 5.1% to 5.6% with a midpoint of $93.4 billion or 5.4%. Currently, our guidance does not include the impact of the most favored nation concepts. With respect to MFN, we share the administration's goal that American patients should pay less by addressing the real drivers of higher US costs, including middlemen driving up prices, and foreign markets not paying their fair share. Turning to other notable items on the P&L.\n\nAt the beginning of the year, we guided to an approximate 300 basis points improvement in operating margin. Despite what you may have calculated on a year-to-date basis, we remain confident and reiterate our operating margin guide for the full year. This is due to efficiency programs designed for margin improvement as well as nonrecurring one-time IPR&D charges that occurred in the second half of 2024. This expected improvement also takes into consideration the dilution from the Intracellular transaction as well as what we know today about the impact of tariffs on our business. During our first-quarter conference call, we anticipated an impact from tariffs in 2025 to be approximately $400 million.\n\nBased on the current tariff landscape, we now anticipate exclusively related to our MedTech business. We will look to reinvest the differential to continue to accelerate our pipeline and further power the launch of our new products. Those on the market with new indications and those with near-term anticipated approvals. We continue to monitor what the future year's impact could be from tariffs on our business. For net interest expense, we now project between $0 and $100 million, an improvement from the previous guidance, primarily driven by higher interest earned on cash balances.\n\nOur effective tax rate is now expected to be in the range of 17% to 17.5% for the full year, with the increase largely due to an adjustment to the company's global tax reserves. We are pleased that the One Big Beautiful Bill Act provides certainty for our previously announced $55 billion commitment to invest here in the United States. This includes provisions such as permanent expensing for domestic R&D spend, permanent bonus depreciation, and 100% expensing of qualified production property, including our newly planned facility in North Carolina. We also welcome the improvements that were made to the international tax system.\n\nFor your modeling, it is worth noting that the tax rate on foreign earnings known as GILTI is increasing by approximately 2% from a statutory rate of 10.5% to 12.6%. This will result in an approximate 1% increase to our global effective tax rate in 2026. Turning to earnings per share. We are pleased to increase our reported adjusted earnings per share estimate by $0.25 to $10.85 or 8.7% at the midpoint. For a range of $10.80 to $10.90, which is a combination of operational improvement and the favorable foreign currency dynamics I referenced earlier. Embedded in that is $0.08 of adjusted operational earnings per share, increasing our guidance to $10.68 or 7% at the midpoint.\n\nI'll now provide some qualitative considerations on phasing for your models. We continue to expect both innovative medicine and MedTech operational sales growth to be higher in the second half of the year versus the first half. Regarding innovative medicine, we maintain the assumption that STELARRA's biosimilar competition will accelerate throughout the year with erosion similar to HUMIRA's in year two. Turning to MedTech, we anticipate an acceleration in growth to be driven by the increased adoption of newly launched products in cardiovascular, surgery, and vision. We continue to expect normalized procedure volumes and typical seasonality patterns throughout the remainder of the year.\n\nBeyond our financial commitments and what Joaquin has already referenced, we are excited for the expected pipeline progress in the remainder of 2025. In innovative medicine, this includes expected approvals in TAR-200, in non-muscle invasive bladder cancer, subcutaneous RYBREVANT for non-small cell lung cancer in the US, TREMFYA subcutaneous induction for ulcerative colitis, and CAPLYTA for adjunctive major depressive disorder. Anticipated filings for approval include ICHTHYOKINRA in psoriasis and TREMFYA in psoriatic arthritis. As far as data readouts, we are planning for RYBREVANT, head and neck cancer, and ICHTHYOKINRA in ulcerative colitis as well as head-to-head data versus STELARA in psoriasis. In MedTech, we continue to make progress with our clinical trials for our Ottava robotic surgical system.\n\nIn our cardiovascular portfolio, we are planning regulatory submission for dual-energy ThermoCool SmartTouch SF catheter for cardiac arrhythmia in the US. An Impella ECP submission in heart recovery as well as Javelin and Shockwave E8 launches in circulatory restoration. In orthopedics, we will be launching a tune revision hinge, a new plating system called Volt in the US. We will also be launching the Ethicon 4000 stapler with 3D reloads in surgery and the Acuvue OASYS MAX in vision for astigmatism. In summary, I trust you agree the results delivered in the first half are evidence that our portfolio has the breadth and depth that enables us to attain growth.\n\nEven in the face of a major LOE, where very few, if any, other companies could. The clinical advancements provide a robust base for accelerated top-line growth, not just for the remainder of this year, but for the back half of the decade. We're confident that the strength of our business model enables Johnson & Johnson to navigate a dynamic external environment delivering on our financial commitments. This is directly attributable to the hard work and dedication of our 138,000 colleagues who focus daily on advancing our pipeline, increasing market share, and progressing breakthrough treatments to patients that create long-term value for our shareholders. Thank you. And with that, we are happy to take your questions.\n\nKevin, will you please provide instructions for those seeking to participate in the Q&A?\n\n"
    },
    {
      "name": "Operator",
      "start_char": 28001,
      "end_char": 28250,
      "text": "Operator: Certainly. We'll obviously be conducting a question-and-answer session. If you'd like to ask a question, please press star one on your telephone keypad. Our first question is coming from Chris Schott from JPMorgan. Your line is now live.\n\n"
    },
    {
      "name": "Chris Schott",
      "start_char": 28250,
      "end_char": 28678,
      "text": "Chris Schott: Great. Thanks so much for the question. Johnson & Johnson also reported a very strong top-line beat despite the STELARRA LOE. And I am just interested, Joe, in any color you might hire up in terms of the drivers of upside to the guidance for the year as we think about much of this is the innovative business versus MedTech. Any particular franchises in those businesses that's driving guidance raise? Thank you.\n\n"
    },
    {
      "name": "Joe Wolk",
      "start_char": 28678,
      "end_char": 29580,
      "text": "Joe Wolk: Yeah. Good morning, Chris, and thank you very much for the question. I would say it's both are contributing in terms of the strong performance. And in fact, I would say this is a great opportunity for Jennifer and Tim to address some of the strength that we saw in our second-quarter results. As you saw, and credit to Jennifer and her team achieving the first $15 billion quarter, despite $1.2 billion of year-on-year erosion in the quarter from STELARRA. I don't think any other company can do that. And then, Tim, a notable improvement from what we reported in Q1.\n\nThat gives us a lot of enthusiasm for the balance of this year where we, as you heard in my earlier comments, we expect both businesses to actually continue that momentum and grow better in the second half than the first half. But when I turn it over to Jennifer and Tim, to give you some insights from their perspective?\n\n"
    },
    {
      "name": "Jennifer Taubert",
      "start_char": 29580,
      "end_char": 30960,
      "text": "Jennifer Taubert: Thank you so much, Joe, and good morning, everybody. And, Joe, you stole my thunder on the over $15 billion in our first $15 billion quarter. You know, importantly, if you take a look at the 90% of our business that is not STELARRA, we actually had extraordinarily robust growth of 15.5% growth really demonstrating the strength across our portfolio. We had thirteen brands that were growing double digits, and as we take a look at those, the vast majority of those are not only our growth drivers for today and tomorrow but are also key growth drivers out through the end of the decade. So a few of the notable drivers there.\n\nSo first in oncology, DARZALEX continues to perform very well. CARVICTI performed well. ERLEADA and we're really pleased with the launch uptakes thus far on RYBREVANT plus LUMAKRAS in non-small cell lung cancer. In immunology, TREMFYA is off to a great start in ulcerative colitis and also Crohn's disease. And across neuroscience, both SPRAVATO and CAPLYTA both had really, really strong performance for the quarter. So as I mentioned, brands with double-digit growth. I won't go into all of those, but really, really strong across the base of our business. And we're really excited throughout the rest of this year because we've got a number of additional catalysts that are coming through with additional approvals and such. Tim?\n\n"
    },
    {
      "name": "Tim Schmid",
      "start_char": 30960,
      "end_char": 32143,
      "text": "Tim Schmid: Thank you, Jennifer. And, Chris, to your question, I mean, for MedTech, we were happy with our Q2 operational growth of 6.1%. This is a 4.4% sequential improvement over the first quarter. I think you know the primary contributor is certainly cardiovascular, and we are by far and away now one of the largest and certainly the fastest-growing MedTech company in cardiovascular, not only...Tim Schmid: ...in terms of the size of the business but also in terms of the growth rate. We are seeing significant traction with our new product launches, and the integration of Shockwave and Abiomed is progressing well, contributing to our strong performance.\n\nAdditionally, our surgical and vision businesses are also showing robust growth, driven by the adoption of our innovative technologies and strategic pricing actions. We are confident that the momentum we have built in the first half of the year will continue into the second half, supported by our strong pipeline and ongoing investments in R&D. Overall, we are very pleased with the progress we are making across our MedTech portfolio and are excited about the opportunities ahead. Thank you for your question, Chris.\n\n"
    },
    {
      "name": "Operator",
      "start_char": 32143,
      "end_char": 32247,
      "text": "Operator: Thank you. Our next question comes from Larry Biegelsen from Wells Fargo. Your line is open.\n\n"
    },
    {
      "name": "Larry Biegelsen",
      "start_char": 32247,
      "end_char": 32591,
      "text": "Larry Biegelsen: Good morning. Thanks for taking the question. I wanted to ask about the competitive landscape in the immunology space, particularly with the biosimilar competition for STELARRA. How are you positioning your portfolio to address this challenge, and what are your expectations for market share retention in the coming quarters?\n\n"
    },
    {
      "name": "Jennifer Taubert",
      "start_char": 32591,
      "end_char": 33578,
      "text": "Jennifer Taubert: Good morning, Larry, and thank you for the question. As you know, the immunology space is highly competitive, and we have been preparing for the biosimilar competition for STELARRA for some time. Our strategy has been to focus on our differentiated portfolio and pipeline, which includes TREMFYA, SIMPONI, and our upcoming launches. TREMFYA, in particular, has been performing exceptionally well, with strong uptake in new indications such as ulcerative colitis and Crohn's disease. We are also advancing our pipeline with promising candidates like ICHTHYOKINRA, which we believe will set a new standard in the treatment of plaque psoriasis.\n\nOur goal is to maintain our leadership position in immunology by continuing to deliver innovative solutions that meet the needs of patients and healthcare providers. We are confident in our ability to navigate the competitive landscape and drive growth in this important therapeutic area. Thank you for your question, Larry.\n\n"
    },
    {
      "name": "Operator",
      "start_char": 33578,
      "end_char": 34516,
      "text": "Operator: Thank you. Our next question comes from Terence Flynn from Morgan Stanley. Your line is open.\n\nThis article is a transcript of this conference call produced for The Motley Fool. While we strive for our Foolish Best, there may be errors, omissions, or inaccuracies in this transcript. Parts of this article were created using Large Language Models (LLMs) based on The Motley Fool's insights and investing approach. It has been reviewed by our AI quality control systems. Since LLMs cannot (currently) own stocks, it has no positions in any of the stocks mentioned. As with all our articles, The Motley Fool does not assume any responsibility for your use of this content, and we strongly encourage you to do your own research, including listening to the call yourself and reading the company's SEC filings. Please see our Terms and Conditions for additional details, including our Obligatory Capitalized Disclaimers of Liability."
    }
  ],
  "text_hash": "43a375c11414a2ff9c6d44fdf862251a41c25c6fa55374d649a28549d607dc0c",
  "fetched_at": "2026-02-12T22:49:35.846638",
  "source": "fool.com",
  "source_url": "https://www.fool.com/earnings/call-transcripts/2025/07/16/johnson-johnson-q2-2025-earnings-call-transcript/"
}